//        Реализовать приложение, которое для заданной последовательности чисел считает
//        произведение тех чисел, сумма цифр которых - простое число. Последнее число
//        последовательности - 0.
//              Пример входных данных:
//                  119 (сумма цифр - 11, простое число)
//                  33542 (сумма цифр - 17, простое число)
//                  99 (сумма цифр - 18, составное число)
//                  991 (сумма цифр - 20, составное число)
//                  0 (последнее число последовательности)
//                  Ответ: 119 * 33542 = 3991498
import java.util.Scanner;

class Program {
    public static void main(String[] args) {

    }
}
